app/Http/Controllers/archivo3.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siiLR="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroLR.xsd" xmlns:sii="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/ssii/fact/ws/SuministroInformacion.xsd"><soapenv:Body><siiLR:SuministroLRFacturasEmitidas ><sii:Cabecera ><sii:IDVersionSii>1.1</sii:IDVersionSii><sii:Titular><sii:NombreRazon>Ruben Nuñez Campillo</sii:NombreRazon><sii:NIF>77856181P</sii:NIF></sii:Titular><sii:TipoComunicacion>A0</sii:TipoComunicacion></sii:Cabecera><siiLR:RegistroLRFacturasEmitidas><sii:PeriodoLiquidacion ><sii:Ejercicio>2023</sii:Ejercicio><sii:Periodo>02</sii:Periodo></sii:PeriodoLiquidacion><siiLR:IDFactura><sii:IDEmisorFactura ><sii:NIF>77856181P</sii:NIF></sii:IDEmisorFactura><sii:NumSerieFacturaEmisor >1</sii:NumSerieFacturaEmisor><sii:FechaExpedicionFacturaEmisor >16/06/2023</sii:FechaExpedicionFacturaEmisor></siiLR:IDFactura><siiLR:FacturaExpedida><sii:TipoFactura >F1</sii:TipoFactura><sii:ClaveRegimenEspecialOTrascendencia >01</sii:ClaveRegimenEspecialOTrascendencia><sii:ImporteTotal >312</sii:ImporteTotal><sii:DescripcionOperacion >Segunda fa</sii:DescripcionOperacion><sii:Contraparte ><sii:NombreRazon>Emilio Núñez Campillo</sii:NombreRazon><sii:NIF>77856151P</sii:NIF></sii:Contraparte><sii:TipoDesglose ><sii:DesgloseFactura><sii:Sujeta><sii:NoExenta><sii:TipoNoExenta>S1</sii:TipoNoExenta><sii:DesgloseIVA><sii:DetalleIVA><sii:TipoImpositivo>4</sii:TipoImpositivo><sii:BaseImponible>300</sii:BaseImponible><sii:CuotaRepercutida>12</sii:CuotaRepercutida><sii:TipoRecargoEquivalencia>0.5</sii:TipoRecargoEquivalencia><sii:CuotaRecargoEquivalencia>1.5</sii:CuotaRecargoEquivalencia></sii:DetalleIVA></sii:DesgloseIVA></sii:NoExenta></sii:Sujeta></sii:DesgloseFactura></sii:TipoDesglose></siiLR:FacturaExpedida></siiLR:RegistroLRFacturasEmitidas><siiLR:RegistroLRFacturasEmitidas><sii:PeriodoLiquidacion ><sii:Ejercicio>2023</sii:Ejercicio><sii:Periodo>2</sii:Periodo></sii:PeriodoLiquidacion><siiLR:IDFactura><sii:IDEmisorFactura ><sii:NIF>77856181P</sii:NIF></sii:IDEmisorFactura><sii:NumSerieFacturaEmisor >3</sii:NumSerieFacturaEmisor><sii:FechaExpedicionFacturaEmisor >17/06/2023</sii:FechaExpedicionFacturaEmisor></siiLR:IDFactura><siiLR:FacturaExpedida><sii:TipoFactura >F1</sii:TipoFactura><sii:ClaveRegimenEspecialOTrascendencia >01</sii:ClaveRegimenEspecialOTrascendencia><sii:ImporteTotal >520</sii:ImporteTotal><sii:DescripcionOperacion >Segunda factura</sii:DescripcionOperacion><sii:Contraparte ><sii:NombreRazon>Ruben Nuñez Campillo</sii:NombreRazon><sii:NIF>77856181P</sii:NIF></sii:Contraparte><sii:TipoDesglose ><sii:DesgloseFactura><sii:Sujeta><sii:NoExenta><sii:TipoNoExenta>S1</sii:TipoNoExenta><sii:DesgloseIVA><sii:DetalleIVA><sii:TipoImpositivo>4</sii:TipoImpositivo><sii:BaseImponible>500</sii:BaseImponible><sii:CuotaRepercutida>20</sii:CuotaRepercutida><sii:TipoRecargoEquivalencia>0.5</sii:TipoRecargoEquivalencia><sii:CuotaRecargoEquivalencia>2.5</sii:CuotaRecargoEquivalencia></sii:DetalleIVA></sii:DesgloseIVA></sii:NoExenta></sii:Sujeta></sii:DesgloseFactura></sii:TipoDesglose></siiLR:FacturaExpedida></siiLR:RegistroLRFacturasEmitidas><siiLR:RegistroLRFacturasEmitidas><sii:PeriodoLiquidacion ><sii:Ejercicio>2023</sii:Ejercicio><sii:Periodo>02</sii:Periodo></sii:PeriodoLiquidacion><siiLR:IDFactura><sii:IDEmisorFactura ><sii:NIF>77856181P</sii:NIF></sii:IDEmisorFactura><sii:NumSerieFacturaEmisor >4</sii:NumSerieFacturaEmisor><sii:FechaExpedicionFacturaEmisor >17/06/2023</sii:FechaExpedicionFacturaEmisor></siiLR:IDFactura><siiLR:FacturaExpedida><sii:TipoFactura >F1</sii:TipoFactura><sii:ClaveRegimenEspecialOTrascendencia >01</sii:ClaveRegimenEspecialOTrascendencia><sii:ImporteTotal >0</sii:ImporteTotal><sii:DescripcionOperacion >opiuhpuip</sii:DescripcionOperacion><sii:Contraparte ><sii:NombreRazon>Ruben Nuñez Campillo</sii:NombreRazon><sii:NIF>77856181P</sii:NIF></sii:Contraparte><sii:TipoDesglose ><sii:DesgloseFactura><sii:Sujeta><sii:NoExenta><sii:TipoNoExenta>S1</sii:TipoNoExenta><sii:DesgloseIVA><sii:DetalleIVA><sii:TipoImpositivo>4</sii:TipoImpositivo><sii:BaseImponible>0</sii:BaseImponible><sii:CuotaRepercutida>0</sii:CuotaRepercutida><sii:TipoRecargoEquivalencia>0.5</sii:TipoRecargoEquivalencia><sii:CuotaRecargoEquivalencia>0</sii:CuotaRecargoEquivalencia></sii:DetalleIVA></sii:DesgloseIVA></sii:NoExenta></sii:Sujeta></sii:DesgloseFactura></sii:TipoDesglose></siiLR:FacturaExpedida></siiLR:RegistroLRFacturasEmitidas></siiLR:SuministroLRFacturasEmitidas></soapenv:Body></soapenv:Envelope>
